; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v3 - type_2 ?v2 - type_3)
 	      (pred_3 ?v6 - object ?v2 - type_3)
	      (pred_2 ?v3 - type_2 ?v1 - type_1)
	      (pred_4 ?v3 - type_2 ?v6 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v3 - type_2 ?v5 ?v7 - type_3)
       :precondition (and  (pred_1 ?v3 ?v5))
       :effect (and  (pred_1 ?v3 ?v7)
		     (not (pred_1 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_2 ?v8 - object ?v4 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v4) (pred_1 ?v3 ?v4) (pred_2 ?v3 ?v1))
       :effect (and (pred_4 ?v3 ?v8 ?v1)
		    (not (pred_3 ?v8 ?v4)) 
		    (not (pred_2 ?v3 ?v1))))

   (:action op_2
       :parameters (?v3 - type_2 ?v8 - object ?v4 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v3 ?v8 ?v1) (pred_1 ?v3 ?v4))
       :effect (and (pred_3 ?v8 ?v4)
		    (pred_2 ?v3 ?v1)
		    (not (pred_4 ?v3 ?v8 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_06 obj_12 - type_2
obj_03 obj_11 obj_10 obj_08 - type_1
obj_02 obj_04 obj_05 obj_01 - type_3
obj_07 obj_13 obj_09 - object)
(:init
(pred_1 obj_06 obj_04)
(pred_2 obj_06 obj_03)
(pred_2 obj_06 obj_11)
(pred_1 obj_12 obj_01)
(pred_2 obj_12 obj_10)
(pred_2 obj_12 obj_08)
(pred_3 obj_07 obj_05)
(pred_3 obj_13 obj_01)
(pred_3 obj_09 obj_05)
)
(:goal
(and
(pred_3 obj_07 obj_02)
(pred_3 obj_13 obj_04)
(pred_3 obj_09 obj_05)
)
)

(:constraints
  (always (not (pred_1 obj_06 obj_05)))
)
)

; plan
1. (op_3 obj_12 obj_13 obj_01 obj_08)
   deleted: (pred_3 obj_13 obj_01) (pred_2 obj_12 obj_08)
   added: (pred_4 obj_12 obj_13 obj_08)
   goals met: 1 of 3
2. (op_1 obj_06 obj_04 obj_02)
   deleted: (pred_1 obj_06 obj_04)
   added: (pred_1 obj_06 obj_02)
   goals met: 1 of 3
3. (op_1 obj_12 obj_01 obj_04)
   deleted: (pred_1 obj_12 obj_01)
   added: (pred_1 obj_12 obj_04)
   goals met: 1 of 3
4. (op_2 obj_12 obj_13 obj_04 obj_08)
   deleted: (pred_4 obj_12 obj_13 obj_08)
   added: (pred_3 obj_13 obj_04) (pred_2 obj_12 obj_08)
   goals met: 2 of 3
5. (op_1 obj_12 obj_04 obj_05)
   deleted: (pred_1 obj_12 obj_04)
   added: (pred_1 obj_12 obj_05)
   goals met: 2 of 3
6. (op_3 obj_12 obj_07 obj_05 obj_08)
   deleted: (pred_3 obj_07 obj_05) (pred_2 obj_12 obj_08)
   added: (pred_4 obj_12 obj_07 obj_08)
   goals met: 2 of 3
7. (op_1 obj_12 obj_05 obj_02)
   deleted: (pred_1 obj_12 obj_05)
   added: (pred_1 obj_12 obj_02)
   goals met: 2 of 3
8. (op_2 obj_12 obj_07 obj_02 obj_08)
   deleted: (pred_4 obj_12 obj_07 obj_08)
   added: (pred_3 obj_07 obj_02) (pred_2 obj_12 obj_08)
   goals met: 3 of 3
